Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<BasedOn>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРаздела</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРазделов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассмотретьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокУчастников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаСостоянияБД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ОбменДаннымиТехПоддержка/Ext/Module.bsl
//Обмен со службой поддержки
Процедура ОбработкаКомандыСервер() Экспорт 
    Адрес = "http://62.64.98.98:18025/bugreport_srv/ws/ws1.1cws?wsdl" ;
    Определения = Новый WSОпределения(Адрес,"СообщениеИзОСМД","183461");
    URI = "http://localhost/ws1";
    Прокси = Новый WSПрокси(Определения, URI, "OSMDReport", "OSMDReportSoap");
	Прокси.Пользователь = "СообщениеИзОСМД";
	Прокси.Пароль = "183461";
	
    СисИнфо = Новый СистемнаяИнформация;
    КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);
    
	//1. Инициализация (если нужно)
	Узел = ПланыОбмена.ОСМД.ЭтотУзел();
    Если НЕ ЗначениеЗаполнено(Узел.Код)
        ИЛИ Узел.Код <> КодМобильногоКомпьютера Тогда
		ОбъектУзла = Узел.ПолучитьОбъект();
		ОбъектУзла.Код = КодМобильногоКомпьютера;
        ОбъектУзла.Наименование = КодМобильногоКомпьютера;
		ОбъектУзла.Записать();
	КонецЕсли;
	
	ЦентральныйУзелОбмена = ПланыОбмена.ОСМД.НайтиПоКоду("001");
    Если ЦентральныйУзелОбмена.Пустая() Тогда
        НовыйУзел = ПланыОбмена.ОСМД.СоздатьУзел();
    	НовыйУзел.Код="001";
    	НовыйУзел.Наименование="Центральный";
    	НовыйУзел.Записать();
        ЦентральныйУзелОбмена = НовыйУзел.Ссылка;
			
	КонецЕсли;
	
	
	//2. Обмен с центральной базой
	ДанныеОбмена = Прокси.ВыполнитьОбмен(КодМобильногоКомпьютера, СформироватьПакетОбмена(ЦентральныйУзелОбмена));	

	
КонецПроцедуры

Функция СформироватьПакетОбмена(УзелОбмена) Экспорт
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
    ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);					
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
	Пока ВыборкаИзменений.Следующий() Цикл
		Данные = ВыборкаИзменений.Получить();
	    ЗаписатьXML(ЗаписьXML, Данные);// Записываем данные в сообщение
    КонецЦикла;
	ЗаписьСообщения.ЗакончитьЗапись();
	Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));
КонецФункции

Процедура  ЗапросВСлужбуТехподдержки(Объект) Экспорт 
	
	УИДБД = УчетКоммунальныхУслуг.ПолучитьИдентификаторБД();
	СостояниеБД = УчетКоммунальныхУслуг.ПолучитьСтрокуСостоянияБД();
	
	ПолучитьУидСообщения = Объект.Ссылка.УникальныйИдентификатор();
	
	лкТекстHTML = "";
	лкВложения = Новый Структура;
	
	Объект.Описание.Получить().ПолучитьHTML(лкТекстHTML, лкВложения);
	Для каждого лкВложение Из лкВложения Цикл
		
		лкТекстHTML = СтрЗаменить(лкТекстHTML, лкВложение.Ключ,"*"+Base64Строка(лкВложение.Значение.ПолучитьДвоичныеДанные())+"'")
	
	КонецЦикла;                                                         
	
	Описание = лкТекстHTML;  
	
	Ответ = УчетКоммунальныхУслуг.ПолучитьПрокси().Send(Строка(ПолучитьУидСообщения),Строка(УИДБД),Описание, Строка(Объект.Важность),Строка(Объект.Тема),Строка(Объект.Раздел.Наименование));
	Объект.КодОтвета = СокрЛП(Ответ);
	
	

		
КонецПроцедуры

Процедура ПолучитьОтветыОтСлужбыПоддержки() Экспорт
	
	СтрокаИдентификаторов = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявка.Ссылка
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |ГДЕ
	               |	Заявка.Рассмотрено = ЛОЖЬ";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			УИД = Выборка.Ссылка.УникальныйИдентификатор();
			Если СтрокаИдентификаторов <> "" Тогда
				СтрокаИдентификаторов =  СтрокаИдентификаторов+ "\" + Строка(УИД);
			Иначе
				СтрокаИдентификаторов = Строка(УИД);
			КонецЕсли;
			
		КонецЦикла;
		ОбновитьСтатусЗаявки(СтрокаИдентификаторов,Выборка.Ссылка);
	КонецЕсли;
	
			
	
КонецПроцедуры
		
Процедура ОбновитьСтатусЗаявки(УИД,Ссылка)
	
	Если  НЕ ОтправитьЗапросНаАвторизацию() Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = УчетКоммунальныхУслуг.ПолучитьПрокси().Update(Строка(УИД));   
	Если Ответ <> Неопределено Тогда
		Сч = 0;
		Пока Сч < Ответ.Ответ.Количество() Цикл
			МассивЗначений = Ответ.Ответ.ПолучитьXDTO(сч);
			УникальныйИдентификатор = Новый УникальныйИдентификатор(МассивЗначений.Уид);
			
			ЗаявкаСсылка = Документы.Заявка.ПолучитьСсылку(УникальныйИдентификатор);
			Если ЗаявкаСсылка = Документы.Заявка.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;	
			
			ЗаявкаОбъект = ЗаявкаСсылка.ПолучитьОбъект();
			ВложенияФорматированогоДокумента = ПолучитьСтруктуруФорматированогоДокумента(МассивЗначений.Текст);
			ФормДок = Новый ФорматированныйДокумент;
			ФормДок.УстановитьHTML(ВложенияФорматированогоДокумента.ТекстHTML,ВложенияФорматированогоДокумента.Вложения);
			ЗаявкаОбъект.ОписаниеОтвета = Новый ХранилищеЗначения(ФормДок);
			ЗаявкаОбъект.рассмотрено = Истина;
			Попытка
				ЗаявкаОбъект.Записать();
				
			Исключение
				
			КонецПопытки;
			Сч = Сч +1;
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруФорматированогоДокумента(ТекстHTML)
	
	
	СтруктураВозврата = Новый Структура;
	НачалоНапр = 1;
	НомерКартинки = 0;
	Метка = Истина;
	
	
	Вложения = Новый Структура;
	Пока Метка = Истина Цикл
		ПозицияНАчала = Найти(ТекстHTML,"*");
		Если ПозицияНАчала <> 0 Тогда
			ПозицияОкончания = Найти(ТекстHTML,"'ъ");
			СтрокаКатринки = Сред(ТекстHTML,ПозицияНАчала+1,(ПозицияОкончания - ПозицияНАчала -1));
			СтрокаУдаления = "*"+СтрокаКатринки+"'ъ";
			
			//НачалоНапр = ПозицияОкончания;
			Картинка = Новый Картинка(Base64Значение(СтрокаКатринки));
			НомерКартинки = НомерКартинки+1;
			КлючКартинки = "image"+Формат(НомерКартинки,"ЧЦ=3; ЧВН=");
			Вложения.Вставить(КлючКартинки,Картинка);
			ТекстHTML = СтрЗаменить(ТекстHTML,СтрокаУдаления,КлючКартинки);
		Иначе
			Метка = Ложь;
		КонецЕсли;                         
	КонецЦикла;
	
	СтруктураВозврата.Вставить("ТекстHTML",ТекстHTML);
	СтруктураВозврата.Вставить("Вложения",Вложения);

	Возврат СтруктураВозврата;
	
КонецФункции

Функция  ОтправитьЗапросНаАвторизацию() Экспорт

	УИДБД = Строка(УчетКоммунальныхУслуг.ПолучитьИдентификаторБД());
	ОписаниеИсточника = Строка(УчетКоммунальныхУслуг.ПолучитьОписаниеИсточника());
	
	Попытка
		Ответ = УчетКоммунальныхУслуг.ПолучитьПрокси().LogIn(ОписаниеИсточника,УИДБД);
		Возврат Ответ;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Произошла ошибка соединения с сервером технической поддержки. Возможно из-за неполадок с подключением к сети ""Интернет""'; uk = 'Сталася помилка з''єднання з сервером технічної підтримки. Можливо із-за неполадок з підключенням до мережі ""Інтернет""'")
		+Символы.ПС+ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецПопытки;	
	
КонецФункции

Функция  ОтправитьЗапросНаРегистрацию(Организация,ФИО,Должность,Город,Email,РегистрационныйНомер,НомерТелефона) Экспорт

	УИДБД = Строка(УчетКоммунальныхУслуг.ПолучитьИдентификаторБД());
	ОписаниеИсточника = Строка(УчетКоммунальныхУслуг.ПолучитьОписаниеИсточника());
	СтруктураЗаполения = Новый  Структура;
	СтруктураЗаполения.Вставить("Организация",Организация);
	СтруктураЗаполения.Вставить("ФИО",ФИО);
	СтруктураЗаполения.Вставить("Должность",Должность);
	СтруктураЗаполения.Вставить("Город",Город);
	СтруктураЗаполения.Вставить("Email",Email);
	СтруктураЗаполения.Вставить("РегистрационныйНомер",РегистрационныйНомер);
	СтруктураЗаполения.Вставить("НомерТелефона",НомерТелефона);
	
	УчетКоммунальныхУслуг.ЗаписатьНастрокиСлужбыПоддержки(СтруктураЗаполения);
	
	Попытка
		Ответ = УчетКоммунальныхУслуг.ПолучитьПрокси().Registration(Организация,ФИО,Должность,Город,Email,РегистрационныйНомер);
		Возврат Ответ;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Произошла ошибка соединения с сервером технической поддержки. Возможно из-за неполадок с подключением к сети ""Интернет""'; uk = 'Сталася помилка з''єднання з сервером технічної підтримки. Можливо із-за неполадок з підключенням до мережі ""Інтернет""'")
		+Символы.ПС+ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецПопытки;	
	
КонецФункции
